[
  {
    "id": "1",
    "project_name": "Car Cruise BD",
    "project_title": "An Online Car Reseller web application for buying and selling reconditioned or second-hand car",
    "description": [
      "This is a Second-hand Car sale web Portal",
      "Here is the homepage you will find the different type car brand category, customers testimonial, advertisement product and featured blog and a dynamic dashboard",
      "If anyone wants, he can click the car cruise bd details and will find detail information about the portal.",
      "In Buyer section Clicking category product details of category product will open and from that anyone can book the product and a buyer can add to wishlist the the product and from dashboard payment will be done.",
      "InSeller Section Seller can add a product and make advertise.",
      "Seller can view the product and also can delete the product.",
      "Admin can add the seller and buyer and a reported items",
      "Admin can make a seller verified. Once Verified it will be shown in product page as verified."
    ],
    "technologies": "React.js, JavaScript, Firebase, Tailwind CSS, daisyUI, Node.js, Express js, MongoDB",
    "liveUrl": "https://car-cruise-bd.web.app/",
    "client": "https://github.com/raj073/Car-Cruise-BD-Client",
    "server": "https://github.com/raj073/Car-Cruise-BD-Server",
    "credentials_email": "rajoni@gmail.com",
    "credentials_password": "123456",
    "image": "https://i.ibb.co/qJbMXQ2/car.png",
    "imageCard": "https://i.ibb.co/NTyKJpB/carCard.jpg",
    "album_image1": "https://i.ibb.co/BzFR1Z3/car1.png",
    "album_image2": "https://i.ibb.co/6rqzXFg/car2.png",
    "album_image3": "https://i.ibb.co/7Y1GK10/car3.png",
    "album_image4": "https://i.ibb.co/3BVx8T8/car4.png"
  },
  {
    "id": "2",
    "project_name": "Order Online eCommerce App",
    "project_title": "A web application named order-online for an e-commerce platform to make an order and save time",
    "description": [
      "This is a web application for an e-commerce platform to make an order and save time",
      "A Responsive Navbar where you'll find all the menu options and navigate to a dynamic page",
      "Sign in page includes Google and Github Sign in along with firebase user SignIn",
      "Sign up also includes Google and Github Sign up along with firebase useremail, Name, photoURL SignUp Method",
      "Home Page includes a banner with extra features",
      "Product page includes men's and women's clothing where user can add a product to a cart, increase the quantity, decrease the quantity, add multiple product and view the total price",
      "Product detail page includes detail of the product history and user can add to cart the product after viewing the product",
      "Note that: Product Detail page is a protected route and in order to go the Product detail route you should login the application.",
      "User can click the cart icon to see the cart list item of the sidebar of the added product",
      "Admin Dashboard is added and from that payment page and cart list product is available and after given the relevant information order can be placed successfully. it is also a protected route.",
      "A responsive footer added below of the page and back to top icon added, Cart and Product are sync with context API",
      "Environment variable added, Responsive for all, Blog page is coming soon"
    ],
    "technologies": "React.js, JavaScript, HTML, CSS, Firebase, Tailwind CSS, React router dom, Context API",
    "liveUrl": "https://order-online-be460.web.app/",
    "client": "https://github.com/raj073/order-online-ecommerce-app",
    "server": "https://github.com/raj073/order-online-ecommerce-app",
    "credentials_email": "",
    "credentials_password": "",
    "image": "https://i.ibb.co/Fx8Dy9K/order-online.jpg",
    "imageCard": "https://i.ibb.co/Fx8Dy9K/order-online.jpg",
    "album_image1": "https://i.ibb.co/MnWyv3z/order1.jpg",
    "album_image2": "https://i.ibb.co/RgGf50G/order2.jpg",
    "album_image3": "https://i.ibb.co/vvtkVHV/order3.jpg",
    "album_image4": "https://i.ibb.co/qRdc4rW/order4.jpg"
  },
  {
    "id": "3",
    "project_name": "Gadget Galaxy PC Builder",
    "project_title": "A web application which is a clean and straightforward PC Builder website for PC parts and components",
    "description": [
      "There is a Navbar and Hero section or Banner where user will find the menus and category section",
      "Login Option is being found in navigation bar where user can sign in with the google and github social login provider to enable user authentication",
      "In Navbar, User can redirect PC Builder page to build the computer with various components",
      "There is 7 categories product component exist in Navbar",
      "Each Product Categories have Product Details where user can find all ther details about product",
      "PC Builder Page have 6 Categories component and Each PC Builder component card have an Add To Builder Button. After Clicking on this button Page will redirect the user to the PC Builder page, and added the selected component below. After adding at least 5 to 6 Components the user will be able to click on the Complete Build button.",
      "The entire application is responsive for both mobile and desktop devices to ensure the enjoyable user experience across all devices."
    ],
    "technologies": "Next js, React.js, JavaScript, HTML, CSS, Firebase, Tailwind CSS, Node Js, Express js",
    "liveUrl": "https://gadget-galaxy-pc-builder.vercel.app/",
    "client": "https://github.com/raj073/gadgetGalaxy-PC-Builder",
    "server": "https://github.com/raj073/gadgetGalaxy-PC-Builder-backend",
    "credentials_email": "",
    "credentials_password": "",
    "image": "https://i.ibb.co/tbbShTq/pc-builder.jpg",
    "imageCard": "https://i.ibb.co/HNCGqhm/pc-builder-image-Card.jpg",
    "album_image1": "https://i.ibb.co/qm8hXzv/pc1.jpg",
    "album_image2": "https://i.ibb.co/NsMdVd8/pc2.jpg",
    "album_image3": "https://i.ibb.co/tmSYc2r/pc3.jpg",
    "album_image4": "https://i.ibb.co/N2N4fbM/pc4.jpg"
  },
  {
    "id": "4",
    "project_name": "Dental Care Service",
    "project_title": "Dental Care Service based Website for Servicing and Reviewing for a Dentist",
    "description": [
      "There is a homepage you will find the Dental care service, appointment and frequently ask questions (FAQ)",
      "If anyone wants he can click the Dental care service details and will find detail information about the service.",
      "In service details user can also find the review of that service and information about the reviewer.",
      "If user is logged in, then he can also add the service for that doctor",
      "After logged in, there is a tab named my review, where user can edit and delete his review",
      "Seller can view the product and also can delete the product.",
      "From the header menu visitors can visit the services and blog. also they can login or log out"
    ],
    "technologies": "React.js, Firebase, Tailwind CSS, Node.js, MongoDB, Vercel",
    "liveUrl": "https://dental-service-care.web.app/",
    "client": "https://github.com/raj073/Dental-Service-Care-Client",
    "server": "https://github.com/raj073/Dental-Service-Care-Server",
    "credentials_email": "",
    "credentials_password": "",
    "image": "https://i.ibb.co/tHn3gj5/dentalcard.jpg",
    "imageCard": "https://i.ibb.co/grJJffJ/dental.png",
    "album_image1": "https://i.ibb.co/PQMbDWQ/dental1.png",
    "album_image2": "https://i.ibb.co/G94Q7wz/dental2.png",
    "album_image3": "https://i.ibb.co/Ns1q7pJ/dental3.png",
    "album_image4": "https://i.ibb.co/4JRHM87/dental4.png"
  },
  {
    "id": "5",
    "project_name": "Distance Learning Platform",
    "project_title": "Online Based Course Enroll Management System",
    "description": [
      "There is a Home Page with Responsive Carousel.",
      "Multi Options Bootstrap Navbar - Course, Blog, FAQ and Toggle Login",
      "6 Responsive Clickable Course Card with a Dynamic Route",
      "Mobile, Tablet and Desktop Responsive",
      "Private Route Page, 404 Not Found Route page.",
      "Firebase Authentication",
      "Dark and Light theme Toggle Option, A fancy Footer"
    ],
    "technologies": "Bootstrap, Firebase, React.js, Node.js, MongoDB",
    "liveUrl": "https://start-logic-client.web.app/",
    "client": "https://github.com/raj073/Start-Logic-Client",
    "server": "https://github.com/raj073/Start-Logic-Server",
    "credentials_email": "",
    "credentials_password": "",
    "image": "https://i.ibb.co/xgRF0Xv/distance.jpg",
    "imageCard": "https://i.ibb.co/SNHWhwD/dl.jpg",
    "album_image1": "https://i.ibb.co/g4Vnpsy/dl1.png",
    "album_image2": "https://i.ibb.co/PcV9XjS/dl2.png",
    "album_image3": "https://i.ibb.co/4ZQVNmp/dl3.png",
    "album_image4": "https://i.ibb.co/CMVdZ5V/dl4.png"
  }
]
